In [22]:
from pandas import Series, DataFrame
import numpy as np

In [85]:
name=['SK하이닉스', '삼성전기', '셀트리온', '삼성SDI', 'POSCO']
data=DataFrame({'price': [30406, 14179, 13275, 10121, 9558],
              'quantity':[335, 142, 41, 48,27],
              'normal_rate':[0.11, 1.74, -1.54, -4.41, 0.29]},
              columns=['price', 'quantity', 'normal_rate'],
              index=name)
data

        price  quantity  normal_rate
SK하이닉스  30406       335         0.11
삼성전기    14179       142         1.74
셀트리온    13275        41        -1.54
삼성SDI   10121        48        -4.41
POSCO    9558        27         0.29

In [84]:
tp=np.array(data['price'].values*data['quantity'].values).tolist()
tp
#tp2={'total_price':tp}
#tp2
#datatp2=DataFrame(tp2, index=name)
#datatp2
#data2=data+datatp2
#data2
data
data['total_price']=tp
data

        price  quantity  normal_rate  total_price
SK하이닉스  30406       335         0.11     10186010
삼성전기    14179       142         1.74      2013418
셀트리온    13275        41        -1.54       544275
삼성SDI   10121        48        -4.41       485808
POSCO    9558        27         0.29       258066

In [86]:
data['price'].values*data['quantity'].values

array([10186010,  2013418,   544275,   485808,   258066], dtype=int64)

In [87]:
np.array(data['price'].values*data['quantity'].values).tolist()

[10186010, 2013418, 544275, 485808, 258066]

In [89]:
type(data['price'])

pandas.core.series.Series

In [90]:
data['price']*data['quantity']

SK하이닉스    10186010
삼성전기       2013418
셀트리온        544275
삼성SDI       485808
POSCO       258066
dtype: int64

In [91]:
type(data['price']*data['quantity'])

pandas.core.series.Series